#include <stdio.h>
#include <unistd.h>

int main(int argv, char *argc[]){
printf("正在读取软件包列表... 完成\n");
printf("正在分析软件包依赖关系...\n");
printf("正在读取状态信息... 完成\n");
sleep(2);
printf("\033[1;31m错误：\033[0m dpkg：王老师 fuck you!\n");
sleep(2);
printf("\033[1;31m错误：\033[0m apt：无法为“王老师”找到任何手册页\n");
sleep(2);
printf("\033[1;31m错误：\033[0m apt：所安装的包没有安装候选\n");
sleep(2);
printf("\033[1;33m警告：\033[0m dpkg：开头为[*]的行会输出较多内容 \n");
sleep(2);
printf("\033[1;31m错误：\033[0m我们老师留了一大堆的作业，太傻逼了，我想直接给他告了，因为我们下午都抬不起头了，所有主旨写两遍，这是人类吗？下午一节副科都没有都被占了，原本下午是有三节副课的，我真服了，我们老师连英伟达都不如，英伟达最起码还能让你抬起头来，我们老师让你日夜不得安宁，人家在那儿低头改这个卷子，他非说人家低头搭着脑袋，就是不听他讲课\n");
sleep(7);
printf("\033[1;31m错误：\033[0m dpkg：无法安装 '王老师' 包\n");
}
